{"version":"https://jsonfeed.org/version/1","title":"HnvDie","home_page_url":"https://hnvdie.github.io/","feed_url":"https://ronaldsvilcins.com/feed.json","description":"wannabe hacker","icon":"https://ronaldsvilcins.com/assets/apple-touch-icon.png","favicon":"https://ronaldsvilcins.com/assets/favicon.ico","expired":false,"author":{"name":"Ronalds Vilcins","url":"https://ronaldsvilcins.com/"},"items":[{"id":"f9a39b17c7faa62edffe0ac31d056aa4d8cb3f92","title":"Panduan Lengkap Jalur Belajar Analisis Teknikal From Zero to Hero","summary":"","content_text":"Trading adalah seni dan ilmu yang membutuhkan pemahaman mendalam terhadap berbagai alat dan indikator yang dapat membantu kita membuat keputusan yang lebih cerdas di pasar. Bagi pemula yang bingung dari mana memulai, artikel ini akan memberikan jalur pembelajaran yang sistematis dan terstruktur, mulai dari konsep dasar hingga teknik lanjutan. Setiap konsep dan alat yang akan dibahas memiliki peran penting dalam membentuk analisis teknikal yang kuat.\nCandlestick Patterns Candlestick patterns adalah fondasi dari analisis teknikal yang mengungkapkan psikologi pasar melalui formasi harga dalam grafik. Menguasai pola candlestick seperti Doji, Hammer, Engulfing, dan Morning/Evening Star akan memberikan wawasan penting tentang kemungkinan pembalikan harga atau kelanjutan tren. Belajar membaca candlestick akan menjadi langkah pertama yang krusial dalam memahami sentimen pasar.\nVolume Volume adalah salah satu indikator paling penting dalam analisis teknikal. Volume menunjukkan seberapa banyak transaksi yang terjadi pada suatu periode waktu. Kombinasi antara pergerakan harga dan volume memberikan sinyal yang lebih kuat. Misalnya, pergerakan harga yang didukung oleh volume yang besar menunjukkan bahwa tren tersebut lebih kuat dan berpotensi berkelanjutan.\nSupport \u0026amp; Resistance / Supply \u0026amp; Demand Level support dan resistance adalah titik di mana harga cenderung berbalik arah. Support adalah area di mana harga biasanya berhenti turun, sementara resistance adalah area di mana harga cenderung berhenti naik. Supply and demand menggambarkan zona di mana terdapat keseimbangan antara penjual dan pembeli, yang mempengaruhi harga. Memahami kedua konsep ini adalah dasar yang penting dalam menetapkan titik entry dan exit.\nAdditional Technical Indicators Ada berbagai indikator tambahan yang dapat digunakan untuk mengonfirmasi sinyal yang diberikan oleh grafik harga. Beberapa indikator yang populer antara lain:\nRSI (Relative Strength Index): Menunjukkan kondisi overbought atau oversold pada pasar. Jika RSI lebih dari 70, pasar dianggap overbought, dan jika di bawah 30, pasar dianggap oversold.\nMA (Moving Average) dan EMA (Exponential Moving Average): Digunakan untuk mengidentifikasi arah tren. MA sederhana memberikan rata-rata harga dalam periode waktu tertentu, sedangkan EMA lebih menekankan pada harga terbaru, memberikan sinyal yang lebih cepat.\nMACD (Moving Average Convergence Divergence): Menggunakan dua MA (biasanya 12 dan 26 hari) untuk menunjukkan sinyal beli atau jual. Ketika MACD melintasi garis sinyal, ini bisa menjadi sinyal untuk entry atau exit.\nVolume Oscillator: Mengukur perbedaan antara dua volume MA, memberikan wawasan tentang kekuatan tren.\nStochastic Oscillator: Digunakan untuk mengukur momentum pasar. Jika nilai indikator mendekati 0, pasar oversold, dan jika mendekati 100, pasar overbought.\nMoney Flow Index (MFI): Kombinasi antara volume dan harga untuk mengidentifikasi pembalikan harga. MFI yang tinggi menunjukkan kemungkinan pembalikan harga.\nPrice Action Price action adalah metode analisis yang hanya mengandalkan pergerakan harga tanpa menggunakan indikator teknikal tambahan. Ini mengajarkan kita untuk membaca pola pergerakan harga dan membuat keputusan berdasarkan konteks pasar saat itu, termasuk level-level harga kunci dan pola candlestick.\nTake Profit \u0026amp; Psychology Menentukan level take profit dan memahami psikologi trading adalah bagian integral dari setiap trading setup. Jangan hanya fokus pada strategi teknikal; penting untuk memahami kapan dan bagaimana keluar dari posisi, serta menjaga emosi tetap terkendali agar tidak terjebak dalam overtrading atau takut kehilangan kesempatan. Pengelolaan psikologi yang baik juga melibatkan pengendalian diri saat pasar bergerak melawan posisi kita dan pentingnya berpegang pada rencana trading untuk menghindari keputusan impulsif.\nFibonacci Retracement and Extension Fibonacci adalah alat yang sangat berguna untuk menentukan level support dan resistance potensial. Dengan menggunakan level retracement (23.6%, 38.2%, 50%, 61.8%, dll.) dan ekstensi (127.2%, 161.8%), trader dapat memprediksi area pembalikan harga atau kelanjutan tren.\nPO3 (Pattern of 3) PO3 adalah konsep yang berbicara tentang pola pergerakan harga dalam tiga langkah. Misalnya, setelah harga melakukan pergerakan pertama dan kedua, langkah ketiga sering kali menjadi pergerakan yang signifikan, baik itu pembalikan atau kelanjutan tren. Mengidentifikasi PO3 dapat membantu trader menangkap peluang pasar yang lebih besar.\nQuarterly Theory Quarterly theory adalah pendekatan yang mengaitkan pergerakan harga dengan siklus tahunan dan triwulanan. Menurut teori ini, pasar bergerak dalam pola tertentu pada periode kuartalan, yang dapat digunakan untuk merencanakan strategi jangka menengah.\nUnicorn Model Unicorn model adalah pendekatan analisis teknikal yang menggabungkan berbagai indikator dan pola harga untuk mengidentifikasi titik-titik entry dan exit terbaik. Model ini menganggap pasar seperti unicorn—unik dan tidak dapat diprediksi, tetapi dengan pola yang dapat dianalisis dengan alat yang tepat.\nICT (Inner Circle Trader) ICT adalah metode yang lebih maju yang mencakup pemahaman mendalam tentang dinamika pasar, termasuk manipulasi harga oleh institusi besar, struktur pasar, dan siklus harga. Teknik-teknik ICT mengajarkan trader untuk memahami bagaimana bank dan institusi besar bergerak di pasar dan bagaimana hal itu memengaruhi harga.\nAMD (Advanced Market Dynamics) AMD adalah pendekatan lanjutan yang melibatkan analisis pasar dengan fokus pada pergerakan harga berdasarkan dinamika internal pasar. Teknik ini juga mengamati perilaku pasar secara keseluruhan, seperti likuiditas dan sentimen pasar. Dalam AMD, trader belajar mengenali pola-pola pergerakan harga yang tidak terdeteksi oleh indikator teknikal sederhana.\nSBKZ SBKZ adalah metode analisis teknikal yang menggabungkan analisis grafik harga dengan analisis sentimen dan perilaku pasar. SBKZ bertujuan untuk memberikan wawasan yang lebih holistik tentang kondisi pasar dan memungkinkan trader untuk membuat keputusan yang lebih baik dengan mempertimbangkan banyak faktor yang mempengaruhi harga.\nMMXM MMXM adalah model yang menggabungkan berbagai pendekatan dalam analisis teknikal, dengan penekanan pada pengelolaan risiko dan strategi posisi. Model ini membantu trader memahami bagaimana mengelola portofolio dan menyesuaikan posisi dengan kondisi pasar. Pengelolaan risiko yang baik sangat penting untuk memastikan bahwa potensi kerugian tetap terkendali dalam setiap trading yang dilakukan.\nFVG (Fair Value Gap) \u0026amp; TS (Trend Shift) FVG dan TS adalah konsep lanjutan yang berfokus pada analisis gap harga (FVG) dan pergeseran tren (TS). FVG mengidentifikasi area harga di mana terjadi kesenjangan dalam pergerakan harga, sementara TS mengidentifikasi momen di mana tren pasar berbalik arah. Keduanya sangat berguna untuk mengidentifikasi titik-titik entry yang optimal dan memaksimalkan potensi keuntungan.\nRisiko dan Pengelolaan Keuangan dalam Trading\nSalah satu aspek yang sangat penting dalam trading adalah pengelolaan risiko dan manajemen keuangan. Meskipun banyak teknik dan indikator yang dapat membantu trader membuat keputusan yang lebih baik, tanpa pengelolaan risiko yang tepat, trader dapat dengan mudah kehilangan sebagian besar modal mereka. Salah satu aspek utama dalam pengelolaan risiko adalah penentuan ukuran posisi yang sesuai dengan tingkat toleransi risiko Anda. Menggunakan rasio risk-to-reward yang sehat, seperti 1:2 atau 1:3, akan memastikan bahwa kerugian yang Anda tanggung tetap lebih kecil dibandingkan dengan potensi keuntungan.\nSelain itu, penting untuk selalu menerapkan stop-loss dan take-profit pada setiap posisi trading Anda. Dengan memiliki batasan risiko yang jelas, Anda menghindari keputusan emosional yang bisa merugikan. Jangan lupa untuk selalu mengevaluasi kembali posisi Anda berdasarkan kondisi pasar yang berubah dan menjaga disiplin dalam menjalankan rencana trading.\nKesimpulan: Dari Zero ke Hero\nTrading bukanlah hal yang bisa dikuasai dalam semalam. Mulailah dengan membangun dasar yang kuat melalui candlestick patterns, volume, support-resistance, dan indikator teknikal dasar. Setelah itu, pelajari konsep-konsep lanjutan seperti Fibonacci, Price Action, dan teori-teori seperti ICT dan Unicorn Model untuk mengasah keterampilan analisis kamu.\nIngat, menjadi trader yang sukses membutuhkan disiplin, pemahaman yang mendalam tentang alat yang kamu gunakan, dan kemampuan untuk mengelola risiko serta psikologi trading. Jangan terburu-buru, nikmati proses belajar ini, dan terus berkembang untuk menjadi seorang trader yang lebih baik.\n","content_html":"\u003cp\u003eTrading adalah seni dan ilmu yang membutuhkan pemahaman mendalam terhadap berbagai alat dan indikator yang dapat membantu kita membuat keputusan yang lebih cerdas di pasar. Bagi pemula yang bingung dari mana memulai, artikel ini akan memberikan jalur pembelajaran yang sistematis dan terstruktur, mulai dari konsep dasar hingga teknik lanjutan. Setiap konsep dan alat yang akan dibahas memiliki peran penting dalam membentuk analisis teknikal yang kuat.\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eCandlestick Patterns\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eCandlestick patterns adalah fondasi dari analisis teknikal yang mengungkapkan psikologi pasar melalui formasi harga dalam grafik. Menguasai pola candlestick seperti Doji, Hammer, Engulfing, dan Morning/Evening Star akan memberikan wawasan penting tentang kemungkinan pembalikan harga atau kelanjutan tren. Belajar membaca candlestick akan menjadi langkah pertama yang krusial dalam memahami sentimen pasar.\u003c/p\u003e\n\u003col start=\"2\"\u003e\n\u003cli\u003eVolume\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eVolume adalah salah satu indikator paling penting dalam analisis teknikal. Volume menunjukkan seberapa banyak transaksi yang terjadi pada suatu periode waktu. Kombinasi antara pergerakan harga dan volume memberikan sinyal yang lebih kuat. Misalnya, pergerakan harga yang didukung oleh volume yang besar menunjukkan bahwa tren tersebut lebih kuat dan berpotensi berkelanjutan.\u003c/p\u003e\n\u003col start=\"3\"\u003e\n\u003cli\u003eSupport \u0026amp; Resistance / Supply \u0026amp; Demand\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eLevel support dan resistance adalah titik di mana harga cenderung berbalik arah. Support adalah area di mana harga biasanya berhenti turun, sementara resistance adalah area di mana harga cenderung berhenti naik. Supply and demand menggambarkan zona di mana terdapat keseimbangan antara penjual dan pembeli, yang mempengaruhi harga. Memahami kedua konsep ini adalah dasar yang penting dalam menetapkan titik entry dan exit.\u003c/p\u003e\n\u003col start=\"4\"\u003e\n\u003cli\u003eAdditional Technical Indicators\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eAda berbagai indikator tambahan yang dapat digunakan untuk mengonfirmasi sinyal yang diberikan oleh grafik harga. Beberapa indikator yang populer antara lain:\u003c/p\u003e\n\u003cp\u003eRSI (Relative Strength Index): Menunjukkan kondisi overbought atau oversold pada pasar. Jika RSI lebih dari 70, pasar dianggap overbought, dan jika di bawah 30, pasar dianggap oversold.\u003c/p\u003e\n\u003cp\u003eMA (Moving Average) dan EMA (Exponential Moving Average): Digunakan untuk mengidentifikasi arah tren. MA sederhana memberikan rata-rata harga dalam periode waktu tertentu, sedangkan EMA lebih menekankan pada harga terbaru, memberikan sinyal yang lebih cepat.\u003c/p\u003e\n\u003cp\u003eMACD (Moving Average Convergence Divergence): Menggunakan dua MA (biasanya 12 dan 26 hari) untuk menunjukkan sinyal beli atau jual. Ketika MACD melintasi garis sinyal, ini bisa menjadi sinyal untuk entry atau exit.\u003c/p\u003e\n\u003cp\u003eVolume Oscillator: Mengukur perbedaan antara dua volume MA, memberikan wawasan tentang kekuatan tren.\u003c/p\u003e\n\u003cp\u003eStochastic Oscillator: Digunakan untuk mengukur momentum pasar. Jika nilai indikator mendekati 0, pasar oversold, dan jika mendekati 100, pasar overbought.\u003c/p\u003e\n\u003cp\u003eMoney Flow Index (MFI): Kombinasi antara volume dan harga untuk mengidentifikasi pembalikan harga. MFI yang tinggi menunjukkan kemungkinan pembalikan harga.\u003c/p\u003e\n\u003col start=\"5\"\u003e\n\u003cli\u003ePrice Action\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003ePrice action adalah metode analisis yang hanya mengandalkan pergerakan harga tanpa menggunakan indikator teknikal tambahan. Ini mengajarkan kita untuk membaca pola pergerakan harga dan membuat keputusan berdasarkan konteks pasar saat itu, termasuk level-level harga kunci dan pola candlestick.\u003c/p\u003e\n\u003col start=\"6\"\u003e\n\u003cli\u003eTake Profit \u0026amp; Psychology\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eMenentukan level take profit dan memahami psikologi trading adalah bagian integral dari setiap trading setup. Jangan hanya fokus pada strategi teknikal; penting untuk memahami kapan dan bagaimana keluar dari posisi, serta menjaga emosi tetap terkendali agar tidak terjebak dalam overtrading atau takut kehilangan kesempatan. Pengelolaan psikologi yang baik juga melibatkan pengendalian diri saat pasar bergerak melawan posisi kita dan pentingnya berpegang pada rencana trading untuk menghindari keputusan impulsif.\u003c/p\u003e\n\u003col start=\"7\"\u003e\n\u003cli\u003eFibonacci Retracement and Extension\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eFibonacci adalah alat yang sangat berguna untuk menentukan level support dan resistance potensial. Dengan menggunakan level retracement (23.6%, 38.2%, 50%, 61.8%, dll.) dan ekstensi (127.2%, 161.8%), trader dapat memprediksi area pembalikan harga atau kelanjutan tren.\u003c/p\u003e\n\u003col start=\"8\"\u003e\n\u003cli\u003ePO3 (Pattern of 3)\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003ePO3 adalah konsep yang berbicara tentang pola pergerakan harga dalam tiga langkah. Misalnya, setelah harga melakukan pergerakan pertama dan kedua, langkah ketiga sering kali menjadi pergerakan yang signifikan, baik itu pembalikan atau kelanjutan tren. Mengidentifikasi PO3 dapat membantu trader menangkap peluang pasar yang lebih besar.\u003c/p\u003e\n\u003col start=\"9\"\u003e\n\u003cli\u003eQuarterly Theory\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eQuarterly theory adalah pendekatan yang mengaitkan pergerakan harga dengan siklus tahunan dan triwulanan. Menurut teori ini, pasar bergerak dalam pola tertentu pada periode kuartalan, yang dapat digunakan untuk merencanakan strategi jangka menengah.\u003c/p\u003e\n\u003col start=\"10\"\u003e\n\u003cli\u003eUnicorn Model\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eUnicorn model adalah pendekatan analisis teknikal yang menggabungkan berbagai indikator dan pola harga untuk mengidentifikasi titik-titik entry dan exit terbaik. Model ini menganggap pasar seperti unicorn—unik dan tidak dapat diprediksi, tetapi dengan pola yang dapat dianalisis dengan alat yang tepat.\u003c/p\u003e\n\u003col start=\"11\"\u003e\n\u003cli\u003eICT (Inner Circle Trader)\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eICT adalah metode yang lebih maju yang mencakup pemahaman mendalam tentang dinamika pasar, termasuk manipulasi harga oleh institusi besar, struktur pasar, dan siklus harga. Teknik-teknik ICT mengajarkan trader untuk memahami bagaimana bank dan institusi besar bergerak di pasar dan bagaimana hal itu memengaruhi harga.\u003c/p\u003e\n\u003col start=\"12\"\u003e\n\u003cli\u003eAMD (Advanced Market Dynamics)\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eAMD adalah pendekatan lanjutan yang melibatkan analisis pasar dengan fokus pada pergerakan harga berdasarkan dinamika internal pasar. Teknik ini juga mengamati perilaku pasar secara keseluruhan, seperti likuiditas dan sentimen pasar. Dalam AMD, trader belajar mengenali pola-pola pergerakan harga yang tidak terdeteksi oleh indikator teknikal sederhana.\u003c/p\u003e\n\u003col start=\"13\"\u003e\n\u003cli\u003eSBKZ\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eSBKZ adalah metode analisis teknikal yang menggabungkan analisis grafik harga dengan analisis sentimen dan perilaku pasar. SBKZ bertujuan untuk memberikan wawasan yang lebih holistik tentang kondisi pasar dan memungkinkan trader untuk membuat keputusan yang lebih baik dengan mempertimbangkan banyak faktor yang mempengaruhi harga.\u003c/p\u003e\n\u003col start=\"14\"\u003e\n\u003cli\u003eMMXM\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eMMXM adalah model yang menggabungkan berbagai pendekatan dalam analisis teknikal, dengan penekanan pada pengelolaan risiko dan strategi posisi. Model ini membantu trader memahami bagaimana mengelola portofolio dan menyesuaikan posisi dengan kondisi pasar. Pengelolaan risiko yang baik sangat penting untuk memastikan bahwa potensi kerugian tetap terkendali dalam setiap trading yang dilakukan.\u003c/p\u003e\n\u003col start=\"15\"\u003e\n\u003cli\u003eFVG (Fair Value Gap) \u0026amp; TS (Trend Shift)\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eFVG dan TS adalah konsep lanjutan yang berfokus pada analisis gap harga (FVG) dan pergeseran tren (TS). FVG mengidentifikasi area harga di mana terjadi kesenjangan dalam pergerakan harga, sementara TS mengidentifikasi momen di mana tren pasar berbalik arah. Keduanya sangat berguna untuk mengidentifikasi titik-titik entry yang optimal dan memaksimalkan potensi keuntungan.\u003c/p\u003e\n\u003cp\u003eRisiko dan Pengelolaan Keuangan dalam Trading\u003c/p\u003e\n\u003cp\u003eSalah satu aspek yang sangat penting dalam trading adalah pengelolaan risiko dan manajemen keuangan. Meskipun banyak teknik dan indikator yang dapat membantu trader membuat keputusan yang lebih baik, tanpa pengelolaan risiko yang tepat, trader dapat dengan mudah kehilangan sebagian besar modal mereka. Salah satu aspek utama dalam pengelolaan risiko adalah penentuan ukuran posisi yang sesuai dengan tingkat toleransi risiko Anda. Menggunakan rasio risk-to-reward yang sehat, seperti 1:2 atau 1:3, akan memastikan bahwa kerugian yang Anda tanggung tetap lebih kecil dibandingkan dengan potensi keuntungan.\u003c/p\u003e\n\u003cp\u003eSelain itu, penting untuk selalu menerapkan stop-loss dan take-profit pada setiap posisi trading Anda. Dengan memiliki batasan risiko yang jelas, Anda menghindari keputusan emosional yang bisa merugikan. Jangan lupa untuk selalu mengevaluasi kembali posisi Anda berdasarkan kondisi pasar yang berubah dan menjaga disiplin dalam menjalankan rencana trading.\u003c/p\u003e\n\u003cp\u003eKesimpulan: Dari Zero ke Hero\u003c/p\u003e\n\u003cp\u003eTrading bukanlah hal yang bisa dikuasai dalam semalam. Mulailah dengan membangun dasar yang kuat melalui candlestick patterns, volume, support-resistance, dan indikator teknikal dasar. Setelah itu, pelajari konsep-konsep lanjutan seperti Fibonacci, Price Action, dan teori-teori seperti ICT dan Unicorn Model untuk mengasah keterampilan analisis kamu.\u003c/p\u003e\n\u003cp\u003eIngat, menjadi trader yang sukses membutuhkan disiplin, pemahaman yang mendalam tentang alat yang kamu gunakan, dan kemampuan untuk mengelola risiko serta psikologi trading. Jangan terburu-buru, nikmati proses belajar ini, dan terus berkembang untuk menjadi seorang trader yang lebih baik.\u003c/p\u003e\n","url":"https://hnvdie.github.io/technical-analysis-zero-to-hero/","image":"https://hnvdie.github.io/photos/<no value>","banner_image":"https://hnvdie.github.io/photos/<no value>","date_published":"22116-22-09T110:2222:00+00:00","date_modified":"22116-22-09T110:2222:00+00:00","author":{"name":"Ronalds Vilcins","url":"https://ronaldsvilcins.com/"}},{"id":"bffdcc4445b0b0ec302305fcf2a387b4228f7494","title":"os command injection","summary":"","content_text":" os command injection biasanya terjadi ketika seorang web developer keliru dalam mengatur penerimaan input didalam situsnya. biasanya terjadi ketika form input yang dibuat menggunakan fungsi seperti exec(), system(), dll. tergantung fungsi tersebut berasal dari bahasa pemogramman apa. jika python biasanya menggunakan os.system() atau eval(), etc.\ntentu saja ini jadi sesuatu yang sangat berbahaya dikarenakan attacker dapat memasukan perintah berbahaya kedalam shell sistem operasi yang ada disitus tersebut.\nSerangan command injection bisa terjadi ketika sebuah aplikasi (forms, cookies, HTTP headers, dll) bisa menjalankan perintah yang tidak aman dari inputan user ke sistem shell. crashtest security menurut crashtest security, os command injection tidak hanya bisa terjadi di forms melainkan bisa saja ditempat lain seperti diatas.\ndemonstrasi # contoh kode php yang rentan dengan os command injection karena ketiadaan validasi input ataupun proses filtering.\n\u0026lt;?php $ip = $_GET['ip']; $cmd = system('ping '.$ip); echo $cmd ?\u0026gt; buat file ping.php \u0026amp; jalankan diterminal kalian $ php -S 127.0.0.1:8000 -t .\nkunjungi dan cobalah masukan input seperti ini\nhttp://127.0.0.1:8000/ping.php?ip=cat%20/etc/passwd\nmaka jika dibrowser saya, ini tidak menghasilkan apa-apa. dikarenakan perintah cat /etc/passwd masih dianggap sebagai argumen untuk ping.\n[Thu Sep 1 18:16:34 2022] 127.0.0.1:41126 Accepted ping: unknown host cat [Thu Sep 1 18:16:34 2022] 127.0.0.1:41125 [200]: GET /ping.php?ip=cat%20/etc/passwd [Thu Sep 1 18:16:34 2022] 127.0.0.1:41125 Closing bisa dilihat disana ada pesan uknown host cat. yang menandakan perintah cat kita dianggap destination dari ping. nah kalian bisa mencoba nya lagi dengan membatalkan perintah ping dengan shell escapes.\n; | || \u0026lt; \u0026amp; \u0026amp;\u0026amp; $() let\u0026rsquo;s try again\nhttp://127.0.0.1:8000/ping.php?ip=;cat /etc/passwd\nmaka kalian bisa melihat bahwa disini kita berhasil untuk melakukan perintah cat terhadap file passwd.\nbtw saya ngejalanin file php nya di termux, jadi output dari /etc/passwd nya agak aneh hhe.\nother references # beberapa referensi lain yang membahas command injection lebih detail.\ncommand injection https://book.hacktricks.xyz/pentesting-web/command-injection ","content_html":"\n\u003cimg src=\"/images/cuteheker.jpeg\"\u003e\n\n\n\u003c!-- raw HTML omitted --\u003e\n\u003cp\u003eos command injection biasanya terjadi ketika seorang web developer keliru\ndalam mengatur penerimaan input didalam situsnya. biasanya terjadi ketika\nform input yang dibuat menggunakan fungsi seperti \u003ccode\u003eexec()\u003c/code\u003e, \u003ccode\u003esystem()\u003c/code\u003e, dll.\ntergantung fungsi tersebut berasal dari bahasa pemogramman apa. jika python\nbiasanya menggunakan \u003ccode\u003eos.system()\u003c/code\u003e atau \u003ccode\u003eeval()\u003c/code\u003e, etc.\u003c/p\u003e\n\u003cp\u003etentu saja ini jadi sesuatu yang sangat berbahaya dikarenakan attacker dapat\nmemasukan perintah berbahaya kedalam shell sistem operasi yang ada disitus tersebut.\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003eSerangan command injection bisa terjadi ketika sebuah aplikasi\n(forms, cookies, HTTP headers, dll) bisa menjalankan perintah yang\ntidak aman dari inputan user ke sistem shell.\n\n\u003ca href=\"https://crashtest-security.com/command-injection/\"\u003ecrashtest security\u003c/a\u003e\n\n\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003emenurut crashtest security, os command injection tidak hanya bisa terjadi\ndi forms melainkan bisa saja ditempat lain seperti diatas.\u003c/p\u003e\n\u003ch1 id=\"demonstrasi\"\u003edemonstrasi \u003ca href=\"#demonstrasi\" class=\"hash\"\u003e#\u003c/a\u003e\u003c/h1\u003e\n\u003cp\u003econtoh kode php yang rentan dengan os command injection karena ketiadaan\nvalidasi input ataupun proses filtering.\u003c/p\u003e\n\u003cpre\u003e\u003ccode class=\"language-shell\"\u003e\u0026lt;?php\n$ip = $_GET['ip'];\n$cmd = system('ping '.$ip); \n\necho $cmd\n?\u0026gt;\n\u003c/code\u003e\u003c/pre\u003e\n\u003cul\u003e\n\u003cli\u003ebuat file \u003ccode\u003eping.php\u003c/code\u003e \u0026amp; jalankan diterminal kalian\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003ccode\u003e$ php -S 127.0.0.1:8000 -t .\u003c/code\u003e\u003c/p\u003e\n\u003cp\u003ekunjungi dan cobalah masukan input seperti ini\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ehttp://127.0.0.1:8000/ping.php?ip=cat%20/etc/passwd\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003emaka jika dibrowser saya, ini tidak menghasilkan apa-apa. dikarenakan perintah\n\u003cstrong\u003ecat /etc/passwd\u003c/strong\u003e masih dianggap sebagai argumen untuk ping.\u003c/p\u003e\n\u003cpre\u003e\u003ccode class=\"language-shell\"\u003e[Thu Sep  1 18:16:34 2022] 127.0.0.1:41126 Accepted\nping: unknown host cat\n[Thu Sep  1 18:16:34 2022] 127.0.0.1:41125 [200]: GET /ping.php?ip=cat%20/etc/passwd\n[Thu Sep  1 18:16:34 2022] 127.0.0.1:41125 Closing\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003ebisa dilihat disana ada pesan \u003cstrong\u003euknown host cat\u003c/strong\u003e. yang menandakan perintah cat\nkita dianggap destination dari ping. nah kalian bisa mencoba nya lagi\ndengan membatalkan perintah ping dengan shell escapes.\u003c/p\u003e\n\u003cpre\u003e\u003ccode\u003e;\n|\n||\n\u0026lt;\n\u0026amp;\n\u0026amp;\u0026amp;\n$()\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003elet\u0026rsquo;s try again\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ehttp://127.0.0.1:8000/ping.php?ip=;cat /etc/passwd\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003emaka kalian bisa melihat bahwa disini kita berhasil untuk melakukan perintah cat\nterhadap file passwd.\u003c/p\u003e\n\n\u003cimg src=\"/images/oci.jpg\"\u003e\n\n\n\u003cp\u003ebtw saya ngejalanin file php nya di termux, jadi output dari \u003cstrong\u003e/etc/passwd\u003c/strong\u003e nya\nagak aneh hhe.\u003c/p\u003e\n\u003ch1 id=\"other-references\"\u003eother references \u003ca href=\"#other-references\" class=\"hash\"\u003e#\u003c/a\u003e\u003c/h1\u003e\n\u003cp\u003ebeberapa referensi lain yang membahas command injection lebih detail.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ecommand injection\n\u003ca href=\"https://book.hacktricks.xyz/pentesting-web/command-injection\"\u003ehttps://book.hacktricks.xyz/pentesting-web/command-injection\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n","url":"https://hnvdie.github.io/os-command-injection/","image":"https://hnvdie.github.io/photos/<no value>","banner_image":"https://hnvdie.github.io/photos/<no value>","date_published":"1096-01-09T90:11:00+00:00","date_modified":"1096-01-09T90:11:00+00:00","author":{"name":"Ronalds Vilcins","url":"https://ronaldsvilcins.com/"}},{"id":"df68ef0626105e0e41737295f3f82352851221e7","title":"Bypass IP restriction at sfile.mobi - writeup","summary":"","content_text":" write up sederhana tentang bagaimana saya bisa menemukan bug IP restriction bypass di situs sfile.mobi.\ndan mendapatkan reward yang lumayan, hanya karena laporan bug sepele ini.\nFYI (For you information) # jadi sebelumnya saya menemukan data leakage dari salah satu website yang tidak bisa saya sebutkan. karena ini privasi web diluar sfile.mobi. yang mana data tersebut berisi informasi seperti username, password dan email. dikarenakan situs yang terdapat data leakage tersebut adalah situs yang memiliki latar belakang seperti sfile.mobi juga. yaitu service free file sharing service. jadinya saya mempunyai ide yang cukup cemerlang.\nkarena saya sering mengunjungi situs sfile.mobi buat download config :/\u0026lt; terlintas dalam pikiran saya.\n\u0026ldquo;apa para pengguna didata yang saya miliki ini, juga login disitus sfile.mobi?\u0026rdquo;\ndan yap tercetus lah ide untuk melakukan brute-forcing.\nProof OF Concept # awalnya saya mencoba mengunjungi halaman sfile.mobi dan ke halaman loginnya untuk melakukan web scraping. yang URL nya berada disini.\nhttps://sfile.mobi/login.php\ndengan tujuan membuat tool atau bot otomatisasi login dengan ribuan data yang saya punya diatas tadi. awalnya saya hanya menulis program sederhana untuk mencobanya. dan ini hasil yang saya temukan.\nsource code: pastebin terlihat disana menunjukan status kode 401 dan programnya crash (stuck) tidak jalan lagi. dikarenakan halaman loginnya sudah tidak bisa diakses atau terkena limit IP. sama hal ketika saya kunjungi melalui browser, IP saya pun sudah terbanned.\nlantas saya mencoba alternatif lain untuk melakukan brute-force tanpa harus terkena limit IP.\nyang pertama saya mencoba dengan proxy namun tetap saja gagal, tidak bisa ditembus. langkah kedua saya mencoba melakukan injeksi terhadap headers ketika melakukan POST request.yaitu melakukan bypass IP source restrictions dengan HTTP headers.\ndisini saya hanya memodifikasi header nya dengan menambahkan nilai.\n\u0026quot;X-Forwarded-For\u0026quot;: IP SPOOF / FAKE IP untuk fake IP saya hanya membuat alamat ip random, asal-asalan saja. dengan syntax python seperti ini atau bisa lihat lengkap disource code bawah.\nip = \u0026quot;.\u0026quot;.join(map(str, (random.randint(0, 255) for _ in range(4)))) source code: pastebin ketika saya jalankan programnya, ternyata IP limit bypassed. saya mencoba ngeload sekitar ribuan akun ternyata bisa dan mendapatkan banyak akun yang online (registered) di platform sfile.mobi.\nstatus bug: patched Referensi tentang IP restriction bypass # 403/401 Bypasses https://book.hacktricks.xyz/network-services-pentesting/pentesting-web/403-and-401-bypasses 403/401 bypass hackerone report https://hackerone.com/reports/991717 IP restriction (root-me CTF) https://archiko.my.id/archives/root-me-writeup-ip-restriction-bypass/ 403 bypass - medium https://sapt.medium.com/bypassing-403-protection-to-get-pagespeed-admin-access-822fab64c0b3 ","content_html":"\u003cp\u003e\n\u003ca href=\"https://www.indiedb.com/groups/tanks/images/girls-und-panzer-gif\" title=\"Girls und Panzer GIF - Indie DB\" target=\"_blank\"\u003e\u003cimg src=\"https://media.indiedb.com/cache/images/groups/1/3/2074/thumb_620x2000/maus_gif.gif\" alt=\"Girls und Panzer GIF\" /\u003e\u003c/a\u003e\n\n\nwrite up sederhana tentang bagaimana saya bisa menemukan bug IP restriction bypass di situs sfile.mobi.\u003c/p\u003e\n\u003cp\u003edan mendapatkan reward yang lumayan, hanya karena laporan bug sepele ini.\u003c/p\u003e\n\u003ch3 id=\"fyi-for-you-information\"\u003eFYI (For you information) \u003ca href=\"#fyi-for-you-information\" class=\"hash\"\u003e#\u003c/a\u003e\u003c/h3\u003e\n\u003cp\u003ejadi sebelumnya saya menemukan data leakage dari salah satu website yang tidak bisa saya sebutkan. karena ini privasi web diluar sfile.mobi. yang mana\ndata tersebut berisi informasi seperti username, password dan email. dikarenakan situs yang terdapat data leakage tersebut adalah situs yang memiliki latar belakang seperti sfile.mobi juga. yaitu service \u003cstrong\u003efree file sharing service\u003c/strong\u003e. jadinya saya mempunyai ide yang cukup cemerlang.\u003c/p\u003e\n\u003cp\u003ekarena saya sering mengunjungi situs sfile.mobi buat download config :/\u0026lt;\nterlintas dalam pikiran saya.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;\u003cem\u003eapa para pengguna didata yang saya miliki ini, juga login disitus sfile.mobi?\u003c/em\u003e\u0026rdquo;\u003c/p\u003e\n\u003cp\u003edan yap tercetus lah ide untuk melakukan brute-forcing.\u003c/p\u003e\n\u003ch1 id=\"proof-of-concept\"\u003eProof OF Concept \u003ca href=\"#proof-of-concept\" class=\"hash\"\u003e#\u003c/a\u003e\u003c/h1\u003e\n\u003cp\u003eawalnya saya mencoba mengunjungi halaman sfile.mobi dan ke halaman loginnya untuk melakukan web scraping.\nyang URL nya berada disini.\u003c/p\u003e\n\u003cp\u003e\u003ccode\u003ehttps://sfile.mobi/login.php\u003c/code\u003e\u003c/p\u003e\n\u003cp\u003edengan tujuan membuat tool atau bot otomatisasi login dengan ribuan data yang saya punya\ndiatas tadi. awalnya saya hanya menulis program sederhana untuk mencobanya. dan ini hasil yang\nsaya temukan.\u003c/p\u003e\n\n\u003cimg src=\"/images/pp1.jpg\" \u003e\nsource code: \u003ca href=\" https://pastebin.com/raw/Kg3p0XKx\"\u003epastebin\u003c/a\u003e\n\n\n\u003cp\u003eterlihat disana menunjukan status kode 401 dan programnya crash (stuck) tidak jalan lagi.\ndikarenakan halaman loginnya sudah tidak bisa diakses atau terkena limit IP.\nsama hal ketika saya kunjungi melalui browser, IP saya pun sudah terbanned.\u003c/p\u003e\n\n\u003cimg src=\"/images/pp2.jpg\" \u003e\n\n\n\u003cp\u003elantas saya mencoba alternatif lain untuk melakukan brute-force tanpa harus terkena limit IP.\u003c/p\u003e\n\u003cp\u003eyang pertama saya mencoba dengan proxy namun tetap saja gagal, tidak bisa ditembus.\nlangkah kedua saya mencoba melakukan injeksi terhadap headers ketika melakukan POST\nrequest.yaitu melakukan bypass IP source restrictions dengan HTTP headers.\u003c/p\u003e\n\u003cp\u003edisini saya hanya memodifikasi header nya dengan menambahkan nilai.\u003c/p\u003e\n\u003cpre\u003e\u003ccode class=\"language-shell\"\u003e\u0026quot;X-Forwarded-For\u0026quot;: IP SPOOF / FAKE IP\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003euntuk fake IP saya hanya membuat alamat ip random, asal-asalan saja.\ndengan syntax python seperti ini atau bisa lihat lengkap disource code bawah.\u003c/p\u003e\n\u003cpre\u003e\u003ccode class=\"language-python\"\u003eip = \u0026quot;.\u0026quot;.join(map(str, (random.randint(0, 255) for _ in range(4))))\n\u003c/code\u003e\u003c/pre\u003e\n\nsource code: \u003ca href=\"https://pastebin.com/raw/Z8nG0T7s\"\u003epastebin\u003c/a\u003e\n\n\n\u003cp\u003eketika saya jalankan programnya, ternyata IP limit bypassed. saya mencoba ngeload sekitar\nribuan akun ternyata bisa dan mendapatkan banyak akun yang online (registered) di platform\nsfile.mobi.\u003c/p\u003e\n\n\u003cimg src=\"/images/pp3.jpg\" \u003e\n\n\n\u003cul\u003e\n\u003cli\u003estatus bug: \u003ccode\u003epatched\u003c/code\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch1 id=\"referensi-tentang-ip-restriction-bypass\"\u003eReferensi tentang IP restriction bypass \u003ca href=\"#referensi-tentang-ip-restriction-bypass\" class=\"hash\"\u003e#\u003c/a\u003e\u003c/h1\u003e\n\u003cul\u003e\n\u003cli\u003e403/401 Bypasses\n\u003ca href=\"https://book.hacktricks.xyz/network-services-pentesting/pentesting-web/403-and-401-bypasses\"\u003ehttps://book.hacktricks.xyz/network-services-pentesting/pentesting-web/403-and-401-bypasses\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e403/401 bypass hackerone report\n\u003ca href=\"https://hackerone.com/reports/991717\"\u003ehttps://hackerone.com/reports/991717\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003eIP restriction (root-me CTF)\n\u003ca href=\"https://archiko.my.id/archives/root-me-writeup-ip-restriction-bypass/\"\u003ehttps://archiko.my.id/archives/root-me-writeup-ip-restriction-bypass/\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e403 bypass - medium\n\u003ca href=\"https://sapt.medium.com/bypassing-403-protection-to-get-pagespeed-admin-access-822fab64c0b3\"\u003ehttps://sapt.medium.com/bypassing-403-protection-to-get-pagespeed-admin-access-822fab64c0b3\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n","url":"https://hnvdie.github.io/bypass-ip-restriction-at-sfile.mobi/","image":"https://hnvdie.github.io/photos/<no value>","banner_image":"https://hnvdie.github.io/photos/<no value>","date_published":"27086-27-09T80:2727:00+00:00","date_modified":"27086-27-09T80:2727:00+00:00","author":{"name":"Ronalds Vilcins","url":"https://ronaldsvilcins.com/"}},{"id":"3c25037c6c05b45c050435c8f138ab49a0756ffc","title":"summary of reconnaissance for web application bug hunting 🕷","summary":"panduan dasar untuk melakukan information gathering terhadap web application sebagai awalan untuk melakukan bug hunting","content_text":" notes: in this article if you found text like this here is a tools or platforms. you just search that on google or other search engines. this article will be to always updated if me found new techniques or methods. base # whois: whois ssl information: sslscan dns enumeration: dnsrecon nslookup dnsx dnsenum identify web technology: whatweb wappalyzer cmsmap check webapp firewall: wafw00f check security headers: shcheck subdo enumeration: subfinder sublist3r knock extracting all IP from collected subdodomain port scanning \u0026amp; banner grabbing: nmap amass aquatone naabu check domain takeover: subzy domain \u0026amp; subdo osint: shodan censys check http(s) 80/443: httpx \u0026gt; altdns \u0026gt; nuclei reverse IP lookup hackertarget googledork bing Content discovery # Fuzzing\ngetting directory, files, sensitive data. scan error like system crash, sql injection, etc. with fuzzing technique\nwfuzz: Web application fuzzer ffuf: Fast web fuzzer written in Go fuzzdb Dictionary of attack patterns and primitives for black-box application fault injection and resource discovery. links and urls\ngetting js files, php, aspx and other interesting files or urls. for scanning endpoint, API path, etc.\ngau: Fetch known URLs from AlienVault\u0026rsquo;s Open Threat Exchange, the Wayback Machine, and Common Crawl. waybackurls: Fetch all the URLs that the Wayback Machine knows about for a domain getJS: A tool to fastly get all javascript sources/files linkfinder: A python script that finds endpoints in JavaScript files assetfinder: Find domains and subdomains related to a given domain Parameters\nparameth: This tool can be used to brute discover GET and POST parameters\nParamSpider: Mining parameters from dark corners of Web Archives\nffuf\ncommix Other helper\ngobuster: Directory/File, DNS and VHost busting tool written in Go\ngospider: Gospider - Fast web spider written in Go\nhakrawler: Simple, fast web crawler designed for easy, quick discovery of endpoints and assets within a web application\ngit-hound: Reconnaissance tool for GitHub code search. Finds exposed API keys using pattern matching, commit history searching, and a unique result scoring system.\npagodo: pagodo (Passive Google Dork) - Automate Google Hacking Database scraping and searching\nExtra resources for you :3 # Cool Recon techniques every hacker misses! 🔥🔥 https://infosecwriteups.com/cool-recon-techniques-every-hacker-misses-1c5e0e294e89\n","content_html":"\n\u003cimg src=\"https://images.unsplash.com/photo-1562813733-b31f71025d54?ixlib=rb-1.2.1\u0026ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8\u0026auto=format\u0026fit=crop\u0026w=869\u0026q=80\"\u003e\n\n\n\u003cp\u003e\u003ccode\u003enotes: \u003c/code\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ein this article if you found text like this \u003ccode\u003ehere\u003c/code\u003e is a tools or platforms. you just search that on google or other search engines.\u003c/li\u003e\n\u003cli\u003ethis article will be to always updated if me found new techniques or methods.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch1 id=\"base\"\u003ebase \u003ca href=\"#base\" class=\"hash\"\u003e#\u003c/a\u003e\u003c/h1\u003e\n\u003cul\u003e\n\u003cli\u003ewhois: \u003ccode\u003ewhois\u003c/code\u003e\u003c/li\u003e\n\u003cli\u003essl information: \u003ccode\u003esslscan\u003c/code\u003e\u003c/li\u003e\n\u003cli\u003edns enumeration: \u003ccode\u003ednsrecon\u003c/code\u003e \u003ccode\u003enslookup\u003c/code\u003e \u003ccode\u003ednsx\u003c/code\u003e \u003ccode\u003ednsenum\u003c/code\u003e\u003c/li\u003e\n\u003cli\u003eidentify web technology: \u003ccode\u003ewhatweb\u003c/code\u003e \u003ccode\u003ewappalyzer\u003c/code\u003e \u003ccode\u003ecmsmap\u003c/code\u003e\u003c/li\u003e\n\u003cli\u003echeck webapp firewall: \u003ccode\u003ewafw00f\u003c/code\u003e\u003c/li\u003e\n\u003cli\u003echeck security headers: \u003ccode\u003eshcheck\u003c/code\u003e\u003c/li\u003e\n\u003cli\u003esubdo enumeration: \u003ccode\u003esubfinder\u003c/code\u003e \u003ccode\u003esublist3r\u003c/code\u003e \u003ccode\u003eknock\u003c/code\u003e\u003c/li\u003e\n\u003cli\u003eextracting all IP from collected subdodomain\u003c/li\u003e\n\u003cli\u003eport scanning \u0026amp; banner grabbing: \u003ccode\u003enmap\u003c/code\u003e \u003ccode\u003eamass\u003c/code\u003e \u003ccode\u003eaquatone\u003c/code\u003e \u003ccode\u003enaabu\u003c/code\u003e\u003c/li\u003e\n\u003cli\u003echeck domain takeover: \u003ccode\u003esubzy\u003c/code\u003e\u003c/li\u003e\n\u003cli\u003edomain \u0026amp; subdo osint: \u003ccode\u003eshodan\u003c/code\u003e \u003ccode\u003ecensys\u003c/code\u003e\u003c/li\u003e\n\u003cli\u003echeck http(s) 80/443: \u003ccode\u003ehttpx\u003c/code\u003e \u0026gt; \u003ccode\u003ealtdns\u003c/code\u003e \u0026gt; \u003ccode\u003enuclei\u003c/code\u003e\u003c/li\u003e\n\u003cli\u003ereverse IP lookup \u003ccode\u003ehackertarget\u003c/code\u003e \u003ccode\u003egoogledork\u003c/code\u003e \u003ccode\u003ebing\u003c/code\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch1 id=\"content-discovery\"\u003eContent discovery \u003ca href=\"#content-discovery\" class=\"hash\"\u003e#\u003c/a\u003e\u003c/h1\u003e\n\u003cp\u003e\u003cstrong\u003eFuzzing\u003c/strong\u003e\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003egetting directory, files, sensitive data.\nscan error like system crash, sql injection, etc.\nwith fuzzing technique\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cul\u003e\n\u003cli\u003e\u003ccode\u003ewfuzz:\u003c/code\u003e Web application fuzzer\u003c/li\u003e\n\u003cli\u003e\u003ccode\u003effuf:\u003c/code\u003e Fast web fuzzer written in Go\u003c/li\u003e\n\u003cli\u003e\u003ccode\u003efuzzdb\u003c/code\u003e Dictionary of attack patterns and primitives for black-box application fault injection and resource discovery.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003elinks and urls\u003c/strong\u003e\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003egetting js files, php, aspx and other interesting files or urls.\nfor scanning endpoint, API path, etc.\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cul\u003e\n\u003cli\u003e\u003ccode\u003egau:\u003c/code\u003e Fetch known URLs from AlienVault\u0026rsquo;s Open Threat Exchange, the Wayback Machine, and Common Crawl.\u003c/li\u003e\n\u003cli\u003e\u003ccode\u003ewaybackurls:\u003c/code\u003e Fetch all the URLs that the Wayback Machine knows about for a domain\u003c/li\u003e\n\u003cli\u003e\u003ccode\u003egetJS:\u003c/code\u003e A tool to fastly get all javascript sources/files\u003c/li\u003e\n\u003cli\u003e\u003ccode\u003elinkfinder:\u003c/code\u003e A python script that finds endpoints in JavaScript files\u003c/li\u003e\n\u003cli\u003e\u003ccode\u003eassetfinder:\u003c/code\u003e Find domains and subdomains related to a given domain\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eParameters\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003e\u003ccode\u003eparameth:\u003c/code\u003e This tool can be used to brute discover GET and POST parameters\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003ccode\u003eParamSpider:\u003c/code\u003e Mining parameters from dark corners of Web Archives\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003ccode\u003effuf\u003c/code\u003e\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003ccode\u003ecommix\u003c/code\u003e\n\u003cstrong\u003eOther helper\u003c/strong\u003e\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003ccode\u003egobuster:\u003c/code\u003e Directory/File, DNS and VHost busting tool written in Go\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003ccode\u003egospider:\u003c/code\u003e Gospider - Fast web spider written in Go\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003ccode\u003ehakrawler:\u003c/code\u003e Simple, fast web crawler designed for easy, quick discovery of endpoints and assets within a web application\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003ccode\u003egit-hound:\u003c/code\u003e Reconnaissance tool for GitHub code search. Finds exposed API keys using pattern matching, commit history searching, and a unique result scoring system.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003ccode\u003epagodo:\u003c/code\u003e pagodo (Passive Google Dork) - Automate Google Hacking Database scraping and searching\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch1 id=\"extra-resources-for-you-3\"\u003eExtra resources for you :3 \u003ca href=\"#extra-resources-for-you-3\" class=\"hash\"\u003e#\u003c/a\u003e\u003c/h1\u003e\n\u003cul\u003e\n\u003cli\u003eCool Recon techniques every hacker misses! 🔥🔥\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003ca href=\"https://infosecwriteups.com/cool-recon-techniques-every-hacker-misses-1c5e0e294e89\"\u003ehttps://infosecwriteups.com/cool-recon-techniques-every-hacker-misses-1c5e0e294e89\u003c/a\u003e\u003c/p\u003e\n","url":"https://hnvdie.github.io/reconnaissance-summary/","image":"https://hnvdie.github.io/photos/<no value>","banner_image":"https://hnvdie.github.io/photos/<no value>","date_published":"26086-26-09T80:2626:00+00:00","date_modified":"26086-26-09T80:2626:00+00:00","author":{"name":"Ronalds Vilcins","url":"https://ronaldsvilcins.com/"}}]}